<!doctype html>
<html lang="en">

<head>
    <title>Title</title>
    <!-- Required meta tags -->
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />

    <!-- Bootstrap CSS v5.2.1 -->
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/css/bootstrap.min.css" rel="stylesheet"
        integrity="sha384-T3c6CoIi6uLrA9TneNEoa7RxnatzjcDSCmG1MXxSR1GAsXEV/Dwwykc2MPK8M2HN" crossorigin="anonymous" />
</head>

<body>
    <header>
        <!-- place navbar here -->
    </header>
    <main>

        <h1>welcome my home page </h1>



        {{ $student }}
        {!! $student !!}



        <h1>{{ $name }}</h1>
        <h1>{{ $id }}</h1>
        <h1>{{ 'My second lecture' }}</h1>
        <h1>{{ time() }}</h1>
        <h1>{{ date('m-d-y') }}</h1>





        @if ($name == 'Ali')
            {{ 'its correct name' }}
        @elseif ($name == 'Admin')
            {{ 'its admin account ' }}
        @else
            {{ 'its incorrect name' }}
        @endif


        @unless ($name == 'christy')
            {{ 'verified user' }}
        @endunless




        @isset($id)
            {{ 'id is verified' . $id }}
        @endisset



        @for ($i = 1; $i < 10; $i++)
            <h1>{{ $i }}</h1>
        @endfor



        @php
            $a = 1;
        @endphp


        @while ($a <= 10)
            <h1>{{ $a }}</h1>

            @php
                $a++;
            @endphp
        @endwhile



        {{-- @php
            $students = ['Arsalan', 'Ali', 'Hussain'];
        @endphp


        @foreach ($students as $item)
            {{ $item }}
        @endforeach --}}


        @php
            $countryList = [
                'AW' => 'آروبا',
                'AZ' => 'أذربيجان',
                'AM' => 'أرمينيا',
                'ES' => 'أسبانيا',
                'AU' => 'أستراليا',
                'AF' => 'أفغانستان',
                'AL' => 'ألبانيا',
                'DE' => 'ألمانيا',
                'AG' => 'أنتيجوا وبربودا',
                'AO' => 'أنجولا',
                'AI' => 'أنجويلا',
                'AD' => 'أندورا',
                'UY' => 'أورجواي',
                'UZ' => 'أوزبكستان',
                'UG' => 'أوغندا',
                'UA' => 'أوكرانيا',
                'IE' => 'أيرلندا',
                'IS' => 'أيسلندا',
                'ET' => 'اثيوبيا',
                'ER' => 'اريتريا',
                'EE' => 'استونيا',
                'IL' => 'اسرائيل',
                'AR' => 'الأرجنتين',
                'JO' => 'الأردن',
                'EC' => 'الاكوادور',
                'AE' => 'الامارات العربية المتحدة',
                'BS' => 'الباهاما',
                'BH' => 'البحرين',
                'BR' => 'البرازيل',
                'PT' => 'البرتغال',
                'BA' => 'البوسنة والهرسك',
                'GA' => 'الجابون',
                'ME' => 'الجبل الأسود',
                'DZ' => 'الجزائر',
                'DK' => 'الدانمرك',
                'CV' => 'الرأس الأخضر',
                'SV' => 'السلفادور',
                'SN' => 'السنغال',
                'SD' => 'السودان',
                'SE' => 'السويد',
                'EH' => 'الصحراء الغربية',
                'SO' => 'الصومال',
                'CN' => 'الصين',
                'IQ' => 'العراق',
                'VA' => 'الفاتيكان',
                'PH' => 'الفيلبين',
                'AQ' => 'القطب الجنوبي',
                'CM' => 'الكاميرون',
                'CG' => 'الكونغو - برازافيل',
                'KW' => 'الكويت',
                'HU' => 'المجر',
                'IO' => 'المحيط الهندي البريطاني',
                'MA' => 'المغرب',
                'TF' => 'المقاطعات الجنوبية الفرنسية',
                'MX' => 'المكسيك',
                'SA' => 'المملكة العربية السعودية',
                'GB' => 'المملكة المتحدة',
                'NO' => 'النرويج',
                'AT' => 'النمسا',
                'NE' => 'النيجر',
                'IN' => 'الهند',
                'US' => 'الولايات المتحدة الأمريكية',
                'JP' => 'اليابان',
                'YE' => 'اليمن',
                'GR' => 'اليونان',
                'ID' => 'اندونيسيا',
                'IR' => 'ايران',
                'IT' => 'ايطاليا',
                'PG' => 'بابوا غينيا الجديدة',
                'PY' => 'باراجواي',
                'PK' => 'باكستان',
                'PW' => 'بالاو',
                'BW' => 'بتسوانا',
                'PN' => 'بتكايرن',
                'BB' => 'بربادوس',
                'BM' => 'برمودا',
                'BN' => 'بروناي',
                'BE' => 'بلجيكا',
                'BG' => 'بلغاريا',
                'BZ' => 'بليز',
                'BD' => 'بنجلاديش',
                'PA' => 'بنما',
                'BJ' => 'بنين',
                'BT' => 'بوتان',
                'PR' => 'بورتوريكو',
                'BF' => 'بوركينا فاسو',
                'BI' => 'بوروندي',
                'PL' => 'بولندا',
                'BO' => 'بوليفيا',
                'PF' => 'بولينيزيا الفرنسية',
                'PE' => 'بيرو',
                'TZ' => 'تانزانيا',
                'TH' => 'تايلند',
                'TW' => 'تايوان',
                'TM' => 'تركمانستان',
                'TR' => 'تركيا',
                'TT' => 'ترينيداد وتوباغو',
                'TD' => 'تشاد',
                'TG' => 'توجو',
                'TV' => 'توفالو',
                'TK' => 'توكيلو',
                'TO' => 'تونجا',
                'TN' => 'تونس',
                'TL' => 'تيمور الشرقية',
                'JM' => 'جامايكا',
                'GI' => 'جبل طارق',
                'GD' => 'جرينادا',
                'GL' => 'جرينلاند',
                'AX' => 'جزر أولان',
                'AN' => 'جزر الأنتيل الهولندية',
                'TC' => 'جزر الترك وجايكوس',
                'KM' => 'جزر القمر',
                'KY' => 'جزر الكايمن',
                'MH' => 'جزر المارشال',
                'MV' => 'جزر الملديف',
                'UM' => 'جزر الولايات المتحدة البعيدة الصغيرة',
                'SB' => 'جزر سليمان',
                'FO' => 'جزر فارو',
                'VI' => 'جزر فرجين الأمريكية',
                'VG' => 'جزر فرجين البريطانية',
                'FK' => 'جزر فوكلاند',
                'CK' => 'جزر كوك',
                'CC' => 'جزر كوكوس',
                'MP' => 'جزر ماريانا الشمالية',
                'WF' => 'جزر والس وفوتونا',
                'CX' => 'جزيرة الكريسماس',
                'BV' => 'جزيرة بوفيه',
                'IM' => 'جزيرة مان',
                'NF' => 'جزيرة نورفوك',
                'HM' => 'جزيرة هيرد وماكدونالد',
                'CF' => 'جمهورية افريقيا الوسطى',
                'CZ' => 'جمهورية التشيك',
                'DO' => 'جمهورية الدومينيك',
                'CD' => 'جمهورية الكونغو الديمقراطية',
                'ZA' => 'جمهورية جنوب افريقيا',
                'GT' => 'جواتيمالا',
                'GP' => 'جوادلوب',
                'GU' => 'جوام',
                'GE' => 'جورجيا',
                'GS' => 'جورجيا الجنوبية وجزر ساندويتش الجنوبية',
                'DJ' => 'جيبوتي',
                'JE' => 'جيرسي',
                'DM' => 'دومينيكا',
                'RW' => 'رواندا',
                'RU' => 'روسيا',
                'BY' => 'روسيا البيضاء',
                'RO' => 'رومانيا',
                'RE' => 'روينيون',
                'ZM' => 'زامبيا',
                'ZW' => 'زيمبابوي',
                'CI' => 'ساحل العاج',
                'WS' => 'ساموا',
                'AS' => 'ساموا الأمريكية',
                'SM' => 'سان مارينو',
                'PM' => 'سانت بيير وميكولون',
                'VC' => 'سانت فنسنت وغرنادين',
                'KN' => 'سانت كيتس ونيفيس',
                'LC' => 'سانت لوسيا',
                'MF' => 'سانت مارتين',
                'SH' => 'سانت هيلنا',
                'ST' => 'ساو تومي وبرينسيبي',
                'LK' => 'سريلانكا',
                'SJ' => 'سفالبارد وجان مايان',
                'SK' => 'سلوفاكيا',
                'SI' => 'سلوفينيا',
                'SG' => 'سنغافورة',
                'SZ' => 'سوازيلاند',
                'SY' => 'سوريا',
                'SR' => 'سورينام',
                'CH' => 'سويسرا',
                'SL' => 'سيراليون',
                'SC' => 'سيشل',
                'CL' => 'شيلي',
                'RS' => 'صربيا',
                'CS' => 'صربيا والجبل الأسود',
                'TJ' => 'طاجكستان',
                'OM' => 'عمان',
                'GM' => 'غامبيا',
                'GH' => 'غانا',
                'GF' => 'غويانا',
                'GY' => 'غيانا',
                'GN' => 'غينيا',
                'GQ' => 'غينيا الاستوائية',
                'GW' => 'غينيا بيساو',
                'VU' => 'فانواتو',
                'FR' => 'فرنسا',
                'PS' => 'فلسطين',
                'VE' => 'فنزويلا',
                'FI' => 'فنلندا',
                'VN' => 'فيتنام',
                'FJ' => 'فيجي',
                'CY' => 'قبرص',
                'KG' => 'قرغيزستان',
                'QA' => 'قطر',
                'KZ' => 'كازاخستان',
                'NC' => 'كاليدونيا الجديدة',
                'HR' => 'كرواتيا',
                'KH' => 'كمبوديا',
                'CA' => 'كندا',
                'CU' => 'كوبا',
                'KR' => 'كوريا الجنوبية',
                'KP' => 'كوريا الشمالية',
                'CR' => 'كوستاريكا',
                'CO' => 'كولومبيا',
                'KI' => 'كيريباتي',
                'KE' => 'كينيا',
                'LV' => 'لاتفيا',
                'LA' => 'لاوس',
                'LB' => 'لبنان',
                'LU' => 'لوكسمبورج',
                'LY' => 'ليبيا',
                'LR' => 'ليبيريا',
                'LT' => 'ليتوانيا',
                'LI' => 'ليختنشتاين',
                'LS' => 'ليسوتو',
                'MQ' => 'مارتينيك',
                'MO' => 'ماكاو الصينية',
                'MT' => 'مالطا',
                'ML' => 'مالي',
                'MY' => 'ماليزيا',
                'YT' => 'مايوت',
                'MG' => 'مدغشقر',
                'EG' => 'مصر',
                'MK' => 'مقدونيا',
                'MW' => 'ملاوي',
                'ZZ' => 'منطقة غير معرفة',
                'MN' => 'منغوليا',
                'MR' => 'موريتانيا',
                'MU' => 'موريشيوس',
                'MZ' => 'موزمبيق',
                'MD' => 'مولدافيا',
                'MC' => 'موناكو',
                'MS' => 'مونتسرات',
                'MM' => 'ميانمار',
                'FM' => 'ميكرونيزيا',
                'NA' => 'ناميبيا',
                'NR' => 'نورو',
                'NP' => 'نيبال',
                'NG' => 'نيجيريا',
                'NI' => 'نيكاراجوا',
                'NZ' => 'نيوزيلاندا',
                'NU' => 'نيوي',
                'HT' => 'هايتي',
                'HN' => 'هندوراس',
                'NL' => 'هولندا',
                'HK' => 'هونج كونج الصينية',
            ];
        @endphp
        <div class="container">

            <select name="" id="">

                @foreach ($countryList as $key => $item)
                    <option value="{{ $key }}">{{ $item }}</option>
                @endforeach

            </select>
        </div>



        @for ($b = 1; $b < 10; $b++)
            @if ($b == 5)
                {{-- @continue --}}
                @break

            @else
                {{ $b }}
            @endif
        @endfor






    </main>
    <footer>
        <!-- place footer here -->
    </footer>
    <!-- Bootstrap JavaScript Libraries -->
    <script src="https://cdn.jsdelivr.net/npm/@popperjs/core@2.11.8/dist/umd/popper.min.js"
        integrity="sha384-I7E8VVD/ismYTF4hNIPjVp/Zjvgyol6VFvRkX/vR+Vc4jQkC+hVqc2pM8ODewa9r" crossorigin="anonymous">
    </script>

    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/dist/js/bootstrap.min.js"
        integrity="sha384-BBtl+eGJRgqQAUMxJ7pMwbEyER4l1g+O15P+16Ep7Q9Q+zqX6gSbd85u4mG4QzX+" crossorigin="anonymous">
    </script>
</body>

</html>
